# AreaBoundaryLinesOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..AreaBoundaryLinesOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Highlighted area boundary lines overlap. Color fills, area tags, and areas may not behave correctly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AreaBoundaryLinesOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaBoundaryLinesOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AreaBoundaryLinesOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace